"About" = "Over";

"Chat and Message Alerts" = "Chat- en berichtwaarschuwingen";

"Notification settings, including push notification settings, are located inside the app.  Open your bookmarks and tap Account Settings." = "Je vindt de meldingsinstellingen, inclusief instellingen voor pushberichten, in de app. Open je favorieten en tik op Accountinstellingen.";

"Notifications" = "Meldingen";

"Photo and Video" = "Foto's en video's";

"Play Sound" = "Geluid afspelen";

"Record HD Video" = "HD-video opnemen";

"Version" = "Versie";

"Vibrate" = "Trillen";

